In [7]:
import pandas as pd
import numpy as np

In [9]:
col  = ['col1','col2','col3','col4','col5']
row  = ['row1','row2','row3','row4','row5']
na = np.nan
data = [[na, 2,na, 4,na],        [ 6, 7,4, 9,2],        [11,na,na,14,15],        [na,17,na,na,20],        [na,22,na,na,25]]
df = pd.DataFrame(data,row,col)

In [12]:
df.fillna('값없음')

      col1  col2 col3  col4  col5
row1   값없음   2.0  값없음   4.0   값없음
row2   6.0   7.0  4.0   9.0   2.0
row3  11.0   값없음  값없음  14.0  15.0
row4   값없음  17.0  값없음   값없음  20.0
row5   값없음  22.0  값없음   값없음  25.0

In [13]:
a1 = [60, 84, 80, 70, 19]
a2 = [77, 62, 95, 85, 17]
a3 = [61, 97, 72, 67, 15]
a4 = [75, 65, 95, 51, 18]
cols = ["국어", "영어", "수학", "과학", "나이"]
df = pd.DataFrame([a1, a2, a3, a4], index=list("ABCD"), columns=cols)

In [14]:
df

   국어  영어  수학  과학  나이
A  60  84  80  70  19
B  77  62  95  85  17
C  61  97  72  67  15
D  75  65  95  51  18

In [18]:
df.sort_values(by='국어',ascending=True)

   국어  영어  수학  과학  나이
A  60  84  80  70  19
C  61  97  72  67  15
D  75  65  95  51  18
B  77  62  95  85  17

In [20]:
df.sort_values(by='영어',ascending=False)

   국어  영어  수학  과학  나이
C  61  97  72  67  15
A  60  84  80  70  19
D  75  65  95  51  18
B  77  62  95  85  17

In [21]:
df.filter(items=['국어','영어'])

   국어  영어
A  60  84
B  77  62
C  61  97
D  75  65

In [25]:
df.asof(where='A')

ValueError: could not convert string to Timestamp